Revit 2024 API
AssemblyInstance.Location Property
This property is used to find the physical location of the assembly instance within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public override Location Location { get; }
Visual Basic
Public Overrides ReadOnly Property Location As Location
	Get
Visual C++
public:
virtual property Location^ Location {
	Location^ get () override;
}
Remarks
The Location property returns an object that can be used to find the location of an object within the project. Assembly instances return a point location object positioned at the center of the assembly instance.
See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace